#!/user/bin/env python3
# -*- coding: utf-8 -*-
# 练习
# 开发者:汪川
# 开发时间: 2021/9/11 16:30
# 地铁购买界面
print('地铁1','','','四惠东→苹果园')
print('','','首车:05:05')
print('','','末车:23:30','','','','票价:起步价2元')
print('---------------------------------------------------------------')
print('1\t\t','3\t\t','5\t\t','7\t\t','9\t\t','11\t\t','12\t\t','14\t\t','16\t\t','18\t\t','20')
print(' ⇌\t\t','⇌\t\t','⇌\t\t','⇌\t\t','⇌\t\t','⇌\t\t','⇌\t\t','⇌\t\t','⇌\t\t','⇌\t\t','⇌\t\t')
print('四惠东 ','大望路   ','水安里\t','东单 ','天安门东\t','西单 ','复兴门 \t','木樨地\t','公主坟\t','五棵松\t','八宝山')