#!/user/bin/env python3
# -*- coding: utf-8 -*-
# 练习
# 开发者:汪川
# 开发时间: 2021/9/19 19:20
import numpy as np

t1 = np.arange(24).reshape(6, 4)
print(t1)
print('---------------------------------------')
# 取行
# print(t1[2])

# 取连续的多行
# print(t1[:])
print('--------------------------------------')

# 取不连续的多行
# print(t1[[1,3,5]])


# print(t1[1,:])
#  print(t1[2:,:])
#  print(t1[[1,3,5],:])

# 取列
#  print(t1[:,0])
# 取连续的多列
#  print(t1[:,2:])
# 取不连续的多列
#  print(t1[:, [0, 1, 3]])

#  取多行多列
# print(t1[0,1]) #第一行第二列
# print(t1[1:,1:])
# print(t1[[1,3,5],1:])
#  取第一行到第四行，第一列到第三列的结果
#  取的是行和列的交叉点问题
#  print(t1[0:4,0:3])
#  取多个不相邻的点
a = t1[[0, 2, 2], [0, 1, 3]]  # 取(0,0),(2,1),(2,3)
print(a)
